wegam/STM32F1xWorkSpace/Driver/Protocol/HC_PHY.C
#include "HC_PHY.H"
#include "STM32_USART.H"
#include "TOOL.H"		//数据校验工具



#include	"stdio.h"			//用于printf
#include	"string.h"		//用于printf
#include	"stdarg.h"		//用于获取不确定个数的参数
#include	"stdlib.h"		//malloc动态申请内存空间



//#include "STM32_GPIO.H"
//#include "STM32_SYS.H"
//#include "STM32_SYSTICK.H"
//#include "STM32_WDG.H"
//#include "STM32_USART.H"
//#include "STM32_PWM.H"

//#include "string.h"				//串和内存操作函数头文件
//#include "stm32f10x_dma.h"

//#define BufferSize	512
//unsigned char RS485BufferRU[1024]={0};		//上级数据接收缓存
//unsigned char RS485BufferTU[1024]={0};		//向上级发送数据缓存
//unsigned char RS485BufferRD[1024]={0};		//下级数据接收缓存
////unsigned char RS485BufferTD[1024]={0};
//unsigned char RS232BufferU[1024]={0};
//unsigned char RS232BufferD[1024]={0};

unsigned char	SerialU	=	0;							  //往上层上传流水号 0x01~0x7D 每次使用后加1(为了不与起始符和结束符冲突，流水号最大值为0x7D)
unsigned char	SerialD	=	0;							  //往下层下发流水号 0x01~0x7D 每次使用后加1(为了不与起始符和结束符冲突，流水号最大值为0x7D)

TransDef  TransU;     //向上传送缓冲区
TransDef  TransD;     //向下传送缓冲区

StepDef UWORKSTEP;											  //往上级接口传送数据步骤
StepDef DWORKSTEP[MaxNetPerLayer]={0};	  //下级接口工作步骤
DataNodeDef	DataNode[MaxNetPerLayer+1];	//目标地址数据数组--按目标地址排序(缓存数组从0开始，目标地址从1开始）

RS485AckNodeDef		RS485ACKU;									//响应上级的应答
RS485AckNodeDef		RS485ACKD;									//响应下级的应答
static HCSYSDef	HCSYS;
unsigned short Lenth	=	0;
unsigned short Lenth2	=	0;

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult HCBoradSet(const unsigned char Layer,const unsigned char id)
{
	HCResult	res	  	=	RES_OK;
  HCSYS.Layer				= Layer;
  HCSYS.SwitchAddr	= id;
	return res;
}

/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: buffer  输入的数据缓存地址
              length  输入的数据长度
              UDflag  0-上层输入的数据
                      1-下层输入的数据
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult SetDataProcess(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
	if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	//===================================上层下发数据：目标地址与本地址相符，UDflag==0
  switch(HCSYS.Layer)
  {
   case MBLayer:      //0-主板(网关板)
        res = MBLayerDataProcess(buffer,length,UDflag);     //单元板数据处理
     break;
   case CALayer:      //1-单元板
        res = CALayerDataProcess(buffer,length,UDflag);     //单元板数据处理
     break;
   case LALayer:      //2-层板
        res = LALayerDataProcess(buffer,length,UDflag);     //层板数据处理
     break;
   case SALayer:      //3-驱动板
        res = SALayerDataProcess(buffer,length,UDflag);     //驱动板数据处理
     break;
   default:break;
  }
  if(RES_OK ==  res)
    res	=	AckDataProcess(buffer,length,UDflag);

	//===================================其它跳过协议和地址的命令（透传）
	return res;
}
/*******************************************************************************
* 函数名			:	GetSubOnlineAddr
* 功能描述		:	获取下级在线设备地址(最大挂载设备数MaxNetPerLayer) 
* 输入			: buffer 接收数据的缓存
							flag		0-获取响应上级的应答
											1-获取响应下级的应答
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
unsigned short GetAck(unsigned char *buffer,unsigned char flag)
{
	unsigned short Length = 0;
	if(0	==	flag)	    //0-获取响应上级的应答
	{
		Length  = RS485ACKU.FarmeLength;
		if(0	!=	Length)
		{			
			memcpy(buffer,&RS485ACKU.data,Length);
			RS485ACKU.FarmeLength	=	0;      
		}
	}
	else						    //1-获取响应下级的应答
	{
		Length  = RS485ACKD.FarmeLength;
		if(0	!=	Length)
		{			
			memcpy(buffer,&RS485ACKD.data,Length);
			RS485ACKD.FarmeLength	=	0; 
		}
	}
	return Length;
}
/*******************************************************************************
* 函数名			:	GetSubOnlineAddr
* 功能描述		:	获取下级在线设备地址(最大挂载设备数MaxNetPerLayer) 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult GetSubOnlineAddr(void)
{
	HCResult	res	  			=	RES_OK;
	RS485FrameDef *Frame 	= NULL;	//接收到的消息帧结构体
	if(	SALayer	>	HCSYS.Layer)	//非最低层板，如果缓存为空，将数据存入缓存数组待转发，如果非空，报忙或者等待状态
	{
		unsigned char	i	=	0;
		//===================================组装数据
		for(i	=	1;i<=MaxNetPerLayer;i++)
		{
			Frame	=	(RS485FrameDef*)DataNode[i].data;			
			Frame->HeadCode					=	RS485Head1;
			Frame->TargetAdd				=	i;
			Frame->SourceAdd				=	0;
			Frame->Serial						=	0x01;
			Frame->Cmd							=	CMD_GET_ADDR;
			Frame->UserCode					=	0x00;
			Frame->StsCode					=	eNoErr;
			Frame->DataLength				=	0;							//数据长度
			Frame->Addr.CabinetAddr	=	0;
			Frame->Addr.LayerAddr		=	0;
			Frame->Addr.SlotAddr		=	0;
			DataNode[i].data[11]		=	BCC8(&DataNode[i].data[0],11);	//从源地址开始计算校验码
			DataNode[i].data[12]		= RS485end1;			//结束符
			DataNode[i].FarmeInfo.Length   = 13;       //数据长度
		}
	}
	return res;
}

/*******************************************************************************
* 函数名			:	AddACKRS485
* 功能描述		:	函数功能说明 
* 输入			: buffer  输入的数据缓存地址
              length  输入的数据长度
              UDflag  0-上层输入的数据
                      1-下层输入的数据
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
HCResult AckDataProcess(const unsigned char *buffer,const unsigned short length,const unsigned char UDflag)
{
	HCResult	res	=	RES_OK;
  RS485FrameDef *RecFrame 	= NULL;	//接收到的消息帧结构体
	RS485FrameDef *AckFrame 	= NULL;	//应答帧结构体
	unsigned char	TargetAdd		=	0;		//目标地址
//	unsigned char	LayerAddr		=	0;		//层地址
//	unsigned char	FrameLength	=	0;		//消息帧总长度，从HeadCode到EndCode的字节数
  if(NULL ==  buffer)		//空地址
  {
    return RES_NODATA;
  }
	//----------------------------------
	RecFrame		=	(RS485FrameDef*)memchr(buffer,RS485Head1,length);		//查找RS485Head1头标识符
	TargetAdd		=	RecFrame->TargetAdd;	          //目标地址
//	LayerAddr		=	RecFrame->Addr.SlotAddr;		    //下一级目标地址：如果下级地址为0，表示此消息是本板使用消息，存入RS485Node[0]
//	FrameLength	=	RecFrame->DataLength+13;
	
	//===================================上层发数据需要向上应答（上层下发地址识别：目标地址为本地址）应答协议：目标地址为0，源地址为本地址，下级及往后地址都为0
  if( (0  ==  UDflag)                         	//上层下发数据标志:向上层应答
    &&(HCSYS.SwitchAddr	==	TargetAdd))  				//目标地址与本拨码地址一致
  {
		if(eBoxAck	==	RecFrame->StsCode)					//此消息为应答消息
		{
			TransU.Length	=	0;
			return RES_OK;
		}
		
